package org.github.caishijun.mediator_008.a_simple_mediator;

/**
 * 一、中介者模式介绍
 *
 * 中介者模式：用一个中介对象来封装一系列的对象交互，中介者使各对象不需要显示地相互引用。从而使其耦合松散，而且可以独立地改变它们之间的交互。
 *
 * 中介者模式核心：1.就是将网状结构处理成星型结构      2.将多对多处理成一对多
 *
 * 例如：世界上各个国家的和平和安全，沟通和交流等等问题，如果各个国家都可以互相交互的话，容易造成混乱，关系复杂。
 *
 *
 *
 * 这个时候联合国的作用就出现了，联合国作为一个中介对象来维护各个国家的和平和安全等等的工作。
 *
 *
 *
 * 中介者模式UML图：
 *
 *
 *
 *
 *
 * 例如：公司中如果没有部门经理，部门中的职员之间的工作沟通，职员和总监工作的沟通，职员和其他部门职员的沟通等等。会造成混乱，每个部门或者每个层级，都需要一个领导人来作为中介和其他组织的人沟通。
 *
 * Colleague（抽象同事类）：
 *
 * ConcreteColleague（具体同事类）：每个具体同事只知道自己的行为，而不了解其他同事类的情况，但他们都认识中介者对象。
 *
 * Mediator（抽象中介者）：定义了同事对象和中介者对象的接口
 *
 * ConcreteMediator（具体中介者对象）：实现抽象中介者的方法，它需要知道所有具体同事类，并从具体同事接收消息，向具体同事对象发出命令。
 *
 * 来源网址：https://www.cnblogs.com/meet/p/5116432.html
 *
 * 二、中介者模式代码实现
 *
 * 这里以公司各部门之间交互，使用中介者（总经理）的方式来代码实现。
 *
 * 首先定义一个抽象中介者（Mediator）对象：这里使用一个接口来定义
 */

//抽象中介者
public interface Mediator {
    void register(String dname,Department d);//将具体的同事类注册到中介者中，让中介者知道所有的同事。以便进行交互
    void command(String dname);//通过部门名称，发出命令
}